'''
Created on 2019年1月31日

@author: ShenJun
'''
import numpy as np

if __name__ == '__main__':
    #===========================================================================
    # numpy.frombuffer
    # 此函数将缓冲区解释为一维数组。 暴露缓冲区接口的任何对象都用作参数来返回ndarray。
    #===========================================================================
#     s = 'Hello World' 
#     a = np.frombuffer(s, dtype = 'S1')  
#     print (a)

    #===========================================================================
    # numpy.fromiter
    # 此函数从任何可迭代对象构建一个ndarray对象，返回一个新的一维数组。
    #===========================================================================
    # 从列表中获得迭代器  
    
    list1 = range(5) 
    it = iter(list1)  
    # 使用迭代器创建 ndarray 
    x = np.fromiter(it, dtype =  float)  
    print (x)
    
    
    #===========================================================================
    # NumPy - 来自数值范围的数组
    #===========================================================================
    
    #===============================================================================
    #     numpy.arange
    # 这个函数返回ndarray对象，包含给定范围内的等间隔值。
    #===============================================================================
    x = np.arange(10,20,2)  
    print (x)
    
    #===============================================================================
    #     numpy.linspace
    # 此函数类似于arange()函数。 在此函数中，指定了范围之间的均匀间隔数量，而不是步长。
    #===============================================================================
    x = np.linspace(10,20,5)  
    print (x)
    
    # 将 endpoint 设为 false
    x = np.linspace(10,20,5, endpoint = False)  
    print (x)

    # 输出 retstep 值
    x = np.linspace(1,2,5, retstep = True)  
    print (x)           
    # 这里的 retstep 为 0.25
    
    #===============================================================================
    #     numpy.logspace
    # 此函数返回一个ndarray对象，其中包含在对数刻度上均匀分布的数字。 刻度的开始和结束端点是某个底数的幂，通常为 10。
    #===============================================================================
    # 默认底数是 10
    a = np.logspace(1.0, 2.0, num = 10)  
    print (a)
    # 将对数空间的底数设置为 2
    a = np.logspace(1, 10, num = 10,  base = 2)  
    print (a)

    

    
